Revit 2024 API
MEPCurveType.PreferredJunctionType Property
The preferred junction type of the MEP curve type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public JunctionType PreferredJunctionType { get; set; }
Visual Basic
Public Property PreferredJunctionType As JunctionType
	Get
	Set
Visual C++
public:
property JunctionType PreferredJunctionType {
	JunctionType get ();
	void set (JunctionType value);
}
Remarks
Use RoutingPreferenceManager to set this property for PipeType MEPCurves.
See Also
MEPCurveType Class
Autodesk.Revit.DB Namespace